In [1]:
import numpy as np

In [2]:
arr3d = np.arange(50).reshape(2,5,5)
arr3d

array([[[ 0,  1,  2,  3,  4],
        [ 5,  6,  7,  8,  9],
        [10, 11, 12, 13, 14],
        [15, 16, 17, 18, 19],
        [20, 21, 22, 23, 24]],

       [[25, 26, 27, 28, 29],
        [30, 31, 32, 33, 34],
        [35, 36, 37, 38, 39],
        [40, 41, 42, 43, 44],
        [45, 46, 47, 48, 49]]])

In [3]:
arr3d[0:,2:5,1:3]

array([[[11, 12],
        [16, 17],
        [21, 22]],

       [[36, 37],
        [41, 42],
        [46, 47]]])

In [4]:
arr3d[1,2,3]

38

In [5]:
arr3d[0,3,4]

19

In [6]:
arr3d[1,2:,1:3]

array([[36, 37],
       [41, 42],
       [46, 47]])

In [7]:
arr3d[0,2:,4:]

array([[14],
       [19],
       [24]])

In [8]:
arr3d[0,2:4,4]

array([14, 19])

In [9]:
arr3d[0:1,2:,4:]

array([[[14],
        [19],
        [24]]])

In [10]:
arr3d[0:,0:,0]

array([[ 0,  5, 10, 15, 20],
       [25, 30, 35, 40, 45]])

In [11]:
arr3d

array([[[ 0,  1,  2,  3,  4],
        [ 5,  6,  7,  8,  9],
        [10, 11, 12, 13, 14],
        [15, 16, 17, 18, 19],
        [20, 21, 22, 23, 24]],

       [[25, 26, 27, 28, 29],
        [30, 31, 32, 33, 34],
        [35, 36, 37, 38, 39],
        [40, 41, 42, 43, 44],
        [45, 46, 47, 48, 49]]])

In [12]:
arr3d[0:,0,:]

array([[ 0,  1,  2,  3,  4],
       [25, 26, 27, 28, 29]])

### Pandas

In [13]:
import pandas as pd

In [14]:
obj = pd.Series([10, 11, 12, 13])
obj

0    10
1    11
2    12
3    13
dtype: int64

In [15]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
obj.values

array([10, 11, 12, 13], dtype=int64)

In [17]:
adict = pd.Series([1,2,3,4,5,6],index=['zero','one','two','three','four','five'],dtype='int8')
adict['one':'five']

one      2
two      3
three    4
four     5
five     6
dtype: int8

In [18]:
obj1 = pd.Series([13,25,56,85],index=['a','b','c','d'])
obj1

a    13
b    25
c    56
d    85
dtype: int64

In [19]:
obj1['d']

85

In [20]:
obj1['c']= 100

In [21]:
obj1['c']

100

In [22]:
del obj1['c']

In [23]:
obj1

a    13
b    25
d    85
dtype: int64

In [24]:
obj1['z']= 26
obj1

a    13
b    25
d    85
z    26
dtype: int64

In [25]:
index = [0,1,2,3]

In [26]:
obj2 = pd.Series(['apple','mango','banana','pineapple'],index=index)

In [27]:
obj2[2]

'banana'

In [28]:
obj2[[3,0,2]]

3    pineapple
0        apple
2       banana
dtype: object

In [29]:
obj2[obj2=='apple']

0    apple
dtype: object

In [30]:
hundreds= pd.Series([100,200,300,400,500],index=['1h','2h','3h','4h','5h'])

In [31]:
hundreds['2h']

200

In [32]:
'4h'in hundreds

True

In [33]:
sdata = {'car':'Audi','model':'2020','color':'white','condition':'used'}

In [34]:
car = pd.Series(sdata)
car

car           Audi
model         2020
color        white
condition     used
dtype: object

In [35]:
car_detail=['name','model','color','condition']

In [36]:
car = pd.Series(sdata,car_detail)
car

name           NaN
model         2020
color        white
condition     used
dtype: object

In [37]:
car.isnull()

name          True
model        False
color        False
condition    False
dtype: bool

In [38]:
pd.isnull(car)

name          True
model        False
color        False
condition    False
dtype: bool

In [39]:
'name' in car

True

## DATA Frames

In [40]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [41]:
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df.shape

(6, 3)

In [44]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [45]:
df.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [46]:
df.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [47]:
pd.DataFrame(data, columns = ['year','state'])

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
state    6 non-null object
year     6 non-null int64
pop      6 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

In [49]:
df.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [50]:
data.update({'debt':[100,200,300,400,500,600]})

frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four',
 'five', 'six'])

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   100
two    2001    Ohio  1.7   200
three  2002    Ohio  3.6   300
four   2001  Nevada  2.4   400
five   2002  Nevada  2.9   500
six    2003  Nevada  3.2   600

In [52]:
frame2[['pop','debt']]

       pop  debt
one    1.5   100
two    1.7   200
three  3.6   300
four   2.4   400
five   2.9   500
six    3.2   600

In [53]:
frame2.loc['five']

year       2002
state    Nevada
pop         2.9
debt        500
Name: five, dtype: object

In [54]:
frame2.iloc[4]

year       2002
state    Nevada
pop         2.9
debt        500
Name: five, dtype: object

In [55]:
val = [0.54,0.68,0.99,0.14,3.2,4.2]

In [56]:
frame2['pop'] = val

In [57]:
frame2.debt[['one','three','six']]=[10,15,25]

C:\Users\mu_vi\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [58]:
frame2

       year   state   pop  debt
one    2000    Ohio  0.54    10
two    2001    Ohio  0.68   200
three  2002    Ohio  0.99    15
four   2001  Nevada  0.14   400
five   2002  Nevada  3.20   500
six    2003  Nevada  4.20    25

In [59]:
frame2['eastern'] = frame2.state == 'Ohio'

In [60]:
frame2

       year   state   pop  debt  eastern
one    2000    Ohio  0.54    10     True
two    2001    Ohio  0.68   200     True
three  2002    Ohio  0.99    15     True
four   2001  Nevada  0.14   400    False
five   2002  Nevada  3.20   500    False
six    2003  Nevada  4.20    25    False

In [61]:
exam_data = {'AI for everyone':[54,86,79,35,94,36],'python2':[58,98,45,74,63,50],'python3':[31,84,99,59,74,39]}

In [62]:
marks = pd.DataFrame(exam_data,index=['Asad','Ali','Nasir','Jhony','Hamza','Mustafa'])
marks

         AI for everyone  python2  python3
Asad                  54       58       31
Ali                   86       98       84
Nasir                 79       45       99
Jhony                 35       74       59
Hamza                 94       63       74
Mustafa               36       50       39

In [63]:
f=[]
for i in range(0,6):
    
    f.append(marks['AI for everyone'][i] + marks['python2'][i] + marks['python3'][i])
    
marks['Total'] = f     
marks

         AI for everyone  python2  python3  Total
Asad                  54       58       31    143
Ali                   86       98       84    268
Nasir                 79       45       99    223
Jhony                 35       74       59    168
Hamza                 94       63       74    231
Mustafa               36       50       39    125

In [64]:
marks[0:3]

       AI for everyone  python2  python3  Total
Asad                54       58       31    143
Ali                 86       98       84    268
Nasir               79       45       99    223

In [65]:
marks['Percentage'] = [ (((marks['AI for everyone'][i] + marks['python2'][i] + marks['python3'][i] ) * 100)
                      / 300) for i in range(0,6)] 
marks

         AI for everyone  python2  python3  Total  Percentage
Asad                  54       58       31    143   47.666667
Ali                   86       98       84    268   89.333333
Nasir                 79       45       99    223   74.333333
Jhony                 35       74       59    168   56.000000
Hamza                 94       63       74    231   77.000000
Mustafa               36       50       39    125   41.666667

In [66]:
# Result upon total marks
marks['Result'] = [ 'Pass' if marks['Total'][i] > 150 else 'Fail' for i in range(0,6) ] 
marks

         AI for everyone  python2  python3  Total  Percentage Result
Asad                  54       58       31    143   47.666667   Fail
Ali                   86       98       84    268   89.333333   Pass
Nasir                 79       45       99    223   74.333333   Pass
Jhony                 35       74       59    168   56.000000   Pass
Hamza                 94       63       74    231   77.000000   Pass
Mustafa               36       50       39    125   41.666667   Fail

In [76]:
# Result upon every exam marks
marks['Result'] = [ 'Pass' if marks['AI for everyone'][i] >= 50 and
                              marks['python2'][i] >= 50 and 
                              marks['python3'][i] >= 50 
                   else 'Fail' for i in range(0,6) ] 
marks

         AI for everyone  python2  python3  Total  Percentage Result
Asad                  54       58       31    143   47.666667   Fail
Ali                   86       98       84    268   89.333333   Pass
Nasir                 79       45       99    223   74.333333   Fail
Jhony                 35       74       59    168   56.000000   Fail
Hamza                 94       63       74    231   77.000000   Pass
Mustafa               36       50       39    125   41.666667   Fail

In [78]:
all(mark['python2']>33)

NameError: name 'mark' is not defined

In [68]:
marks['AI for everyone'][0]>50

True

In [69]:
marks['AI for everyone']['Asad':'Mustafa']

Asad       54
Ali        86
Nasir      79
Jhony      35
Hamza      94
Mustafa    36
Name: AI for everyone, dtype: int64

In [70]:
marks[['AI for everyone','python3']]

         AI for everyone  python3
Asad                  54       31
Ali                   86       84
Nasir                 79       99
Jhony                 35       59
Hamza                 94       74
Mustafa               36       39

In [71]:
marks[['AI for everyone','python2','python3']].loc["Asad"] > 50

AI for everyone     True
python2             True
python3            False
Name: Asad, dtype: bool

In [72]:
marks.iloc[0:2]

      AI for everyone  python2  python3  Total  Percentage Result
Asad               54       58       31    143   47.666667   Fail
Ali                86       98       84    268   89.333333   Pass

In [73]:
adict = pd.Series([1,2,3,4,5,6],index=[0,1,2,3,4,5],dtype='int8')
adict[0:5]

0    1
1    2
2    3
3    4
4    5
dtype: int8

In [74]:
adict = pd.Series([1,2,3,4,5,6],index=['0','1','2','3','4','5'],dtype='int8')
adict['0':'5']

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int8